redisTestResult/redisMutiThreadsTestResult/redis_test_result_by_memtier_benchmark_F_OFF_2nd/redis_result_Random110_F_OFF_P3_2nd_20230717231450.log
20        Threads
5         Connections per thread
50        Seconds


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets        27505.56          ---          ---         3.28909         3.19900         6.46300         7.03900     29708.16 
Gets         2749.61      2749.61         0.00         3.43286         3.18300         6.46300         7.23100      2956.36 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals      30255.17      2749.61         0.00         3.30216         3.18300         6.46300         7.03900     32664.52 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       0.311        0.000
SET       2.927        5.000
SET       2.975       10.000
SET       3.007       15.000
SET       3.039       20.000
SET       3.055       25.000
SET       3.087       30.000
SET       3.103       35.000
SET       3.135       40.000
SET       3.167       45.000
SET       3.199       50.000
SET       3.199       52.500
SET       3.215       55.000
SET       3.231       57.500
SET       3.263       60.000
SET       3.279       62.500
SET       3.295       65.000
SET       3.311       67.500
SET       3.327       70.000
SET       3.343       72.500
SET       3.359       75.000
SET       3.375       76.250
SET       3.375       77.500
SET       3.391       78.750
SET       3.391       80.000
SET       3.407       81.250
SET       3.423       82.500
SET       3.423       83.750
SET       3.439       85.000
SET       3.455       86.250
SET       3.455       87.500
SET       3.471       88.125
SET       3.471       88.750
SET       3.471       89.375
SET       3.487       90.000
SET       3.487       90.625
SET       3.503       91.250
SET       3.519       91.875
SET       3.519       92.500
SET       3.535       93.125
SET       3.551       93.750
SET       3.567       94.062
SET       3.567       94.375
SET       3.583       94.688
SET       3.615       95.000
SET       3.647       95.312
SET       3.679       95.625
SET       3.743       95.938
SET       3.839       96.250
SET       3.935       96.562
SET       4.031       96.875
SET       4.127       97.031
SET       4.287       97.188
SET       4.383       97.344
SET       4.575       97.500
SET       5.727       97.656
SET       5.951       97.812
SET       6.015       97.969
SET       6.079       98.125
SET       6.143       98.281
SET       6.207       98.438
SET       6.239       98.516
SET       6.271       98.594
SET       6.303       98.672
SET       6.335       98.750
SET       6.367       98.828
SET       6.399       98.906
SET       6.431       98.984
SET       6.495       99.062
SET       6.527       99.141
SET       6.559       99.219
SET       6.591       99.258
SET       6.623       99.297
SET       6.623       99.336
SET       6.655       99.375
SET       6.687       99.414
SET       6.687       99.453
SET       6.719       99.492
SET       6.751       99.531
SET       6.783       99.570
SET       6.783       99.609
SET       6.815       99.629
SET       6.815       99.648
SET       6.815       99.668
SET       6.847       99.688
SET       6.847       99.707
SET       6.879       99.727
SET       6.879       99.746
SET       6.879       99.766
SET       6.911       99.785
SET       6.911       99.805
SET       6.943       99.814
SET       6.943       99.824
SET       6.943       99.834
SET       6.975       99.844
SET       6.975       99.854
SET       6.975       99.863
SET       7.007       99.873
SET       7.007       99.883
SET       7.039       99.893
SET       7.039       99.902
SET       7.039       99.907
SET       7.071       99.912
SET       7.071       99.917
SET       7.103       99.922
SET       7.103       99.927
SET       7.135       99.932
SET       7.135       99.937
SET       7.167       99.941
SET       7.231       99.946
SET       7.263       99.951
SET       7.295       99.954
SET       7.327       99.956
SET       7.359       99.958
SET       7.423       99.961
SET       7.519       99.963
SET       7.583       99.966
SET       7.647       99.968
SET       7.711       99.971
SET       7.807       99.973
SET       7.839       99.976
SET       7.903       99.977
SET       7.903       99.978
SET       7.967       99.979
SET       7.999       99.980
SET       8.063       99.982
SET       8.095       99.983
SET       8.127       99.984
SET       8.191       99.985
SET       8.255       99.987
SET       8.383       99.988
SET       8.383       99.988
SET       8.511       99.989
SET       8.575       99.990
SET       8.639       99.990
SET       8.703       99.991
SET       8.703       99.991
SET       8.703       99.992
SET       8.767       99.993
SET       8.767       99.993
SET       8.831       99.994
SET       8.831       99.994
SET       8.895       99.995
SET       8.895       99.995
SET       8.959       99.995
SET       8.959       99.995
SET       8.959       99.996
SET       9.023       99.996
SET       9.087       99.996
SET       9.535       99.997
SET       9.791       99.997
SET      10.047       99.997
SET      10.111       99.997
SET      10.495       99.997
SET     374.783       99.998
SET     374.783       99.998
SET     374.783       99.998
SET     376.831       99.998
SET     376.831       99.998
SET     376.831       99.998
[...]
SET     376.831       99.999
SET     376.831       99.999
SET     376.831       99.999
[...]
SET     376.831      100.000
SET     376.831      100.000
SET     376.831      100.000
[...]
SET     378.879      100.000
SET     378.879      100.000
SET     378.879      100.000
[...]
SET     382.975      100.000
SET     382.975      100.000
---
GET       1.151        0.000
GET       2.911        5.000
GET       2.975       10.000
GET       3.007       15.000
GET       3.039       20.000
GET       3.055       25.000
GET       3.087       30.000
GET       3.103       35.000
GET       3.135       40.000
GET       3.151       45.000
GET       3.183       50.000
GET       3.199       52.500
GET       3.215       55.000
GET       3.231       57.500
GET       3.247       60.000
GET       3.247       62.500
GET       3.263       65.000
GET       3.279       67.500
GET       3.295       70.000
GET       3.311       72.500
GET       3.327       75.000
GET       3.343       76.250
GET       3.343       77.500
GET       3.359       78.750
GET       3.359       80.000
GET       3.375       81.250
GET       3.391       82.500
GET       3.391       83.750
GET       3.407       85.000
GET       3.407       86.250
GET       3.423       87.500
GET       3.423       88.125
GET       3.439       88.750
GET       3.439       89.375
GET       3.455       90.000
GET       3.455       90.625
GET       3.455       91.250
GET       3.471       91.875
GET       3.487       92.500
GET       3.487       93.125
GET       3.503       93.750
GET       3.503       94.062
GET       3.519       94.375
GET       3.519       94.688
GET       3.535       95.000
GET       3.551       95.312
GET       3.551       95.625
GET       3.567       95.938
GET       3.599       96.250
GET       3.647       96.562
GET       3.711       96.875
GET       3.759       97.031
GET       3.855       97.188
GET       3.983       97.344
GET       4.319       97.500
GET       4.927       97.656
GET       5.887       97.812
GET       6.015       97.969
GET       6.079       98.125
GET       6.143       98.281
GET       6.207       98.438
GET       6.239       98.516
GET       6.271       98.594
GET       6.303       98.672
GET       6.335       98.750
GET       6.367       98.828
GET       6.399       98.906
GET       6.463       98.984
GET       6.495       99.062
GET       6.527       99.141
GET       6.591       99.219
GET       6.623       99.258
GET       6.623       99.297
GET       6.655       99.336
GET       6.687       99.375
GET       6.719       99.414
GET       6.719       99.453
GET       6.751       99.492
GET       6.751       99.531
GET       6.783       99.570
GET       6.815       99.609
GET       6.815       99.629
GET       6.815       99.648
GET       6.847       99.668
GET       6.847       99.688
GET       6.879       99.707
GET       6.879       99.727
GET       6.911       99.746
GET       6.911       99.766
GET       6.943       99.785
GET       6.943       99.805
GET       6.975       99.814
GET       6.975       99.824
GET       7.007       99.834
GET       7.007       99.844
GET       7.039       99.854
GET       7.039       99.863
GET       7.071       99.873
GET       7.103       99.883
GET       7.135       99.893
GET       7.263       99.902
GET       7.327       99.907
GET       7.391       99.912
GET       7.519       99.917
GET       7.615       99.922
GET       7.807       99.927
GET       7.903       99.932
GET       8.031       99.937
GET       8.319       99.941
GET       8.767       99.946
GET       9.791       99.951
GET     374.783       99.954
GET     374.783       99.956
GET     374.783       99.958
GET     374.783       99.961
GET     374.783       99.963
GET     376.831       99.966
GET     376.831      100.000
---
WAIT      0.000      100.000